verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/rsr.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/lsr_mult.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/comp.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/acc.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/control_mult.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/mult/mult_32.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ctrl_wsled.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ws2812.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/comp_ws_arr.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/count_wsled.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ws2812_led_array.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ctrl_ws.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/comp_ws.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/count_ws.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/lsr_wsled.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ws2812_led.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ws2812_periph.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/count_addr.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/ctrl_ws_arr.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/led_mem_dual.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/ws2812/mux_ws.v
read_verilog /home/cristhianhendes/litex/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv.v
read_verilog /home/cristhianhendes/digital_2/Digital-2/calculadora/build/colorlight_i5/gateware/colorlight_i5.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top colorlight_i5
write_json  colorlight_i5.json